| ID  | UC-LU4  |
|:---|:---|
|Назва   |Зміна інформації профілю|
|Учасники   |Зареєстрований користувач; Система   |
|Передумови   | Користувач увійшов у систему під своїм логіном і паролем|
|Результат|Зміна інформації про користувача|
|Виключні ситуації|-|
|Основний сценарій| 1. Користувач натискає кнопку [Профіль].<br> 2. Система перенаправляє користувача на сторінку "Профіль".<br> 3. Користувач натискає кнопку [Змінити інформацію].<br>4. Система надає форму "Зміна інформації профіля"<br>5. Користувач змінює поля: ім'я, логін, фотографія профілю, номер телефону.<br> 6. Система перевіряє введені дані. <br> 7. Система зберегає дані у базі даних. <br>8. Система надає повідомлення про успішну зміну інформаціі профіля. 
